api/app/models/state.rb

SELECT  "states".* FROM "states" ORDER BY "states"."id" ASC LIMIT $1  [["LIMIT", 6]]
---
  def self.front_page
    State.all.first(6)