api/app/models/unit.rb

SELECT "units".* FROM "units"
SELECT  "units".* FROM "units" WHERE "units"."name" = $1 LIMIT $2  [["name", "liter"], ["LIMIT", 1]]
---
  def self.method_missing(method, *args)
    if Unit.all.map(&:name).include? method.to_s.downcase
      Unit.find_by_name(method)