api/app/models/vessel_type.rb

  def self.flex_tank
    VesselType.find_by_name 'FlexTank'
---
SELECT  "vessel_types".* FROM "vessel_types" WHERE "vessel_types"."name" = $1 LIMIT $2  [["name", "FlexTank"], ["LIMIT", 1]]

  def self.barrel
    VesselType.find_by_name 'Barrel'
---
SELECT  "vessel_types".* FROM "vessel_types" WHERE "vessel_types"."name" = $1 LIMIT $2  [["name", "Barrel"], ["LIMIT", 1]]