app/models/racking.rb

SELECT  "states".* FROM "states" WHERE "states"."name" = $1 LIMIT $2  [["name", "packaged"], ["LIMIT", 1]]
---
  def check_packaged
    if state == State.find_by_name('packaged')